//
//  APIManager.h
//  GitHubAPI
//
//  Created by Admin on 13/05/2020.
//  Copyright © 2020 iOS-Team. All rights reserved.
//

#import <Foundation/Foundation.h>
#import "APIConsts.h"
#import "AuthProtocol.h"
#import <RXNetworkOperation/RXNO_OperationProtocols.h>


NS_ASSUME_NONNULL_BEGIN

// models
@class Friend;
@class UserProfile;
@class WallPost;
@class Photo;
@class PhotoGalleryCollection;


/*--------------------------------------------------------------------------------------------------------------
 🌐🕹 'APIManager' - управляет всеми сетевыми соединениями.
 ---------------
 Основная задача класса - создание, изменение и выполнение сетевых операций.
 ---------------
 [⚖️] Обязанности:
 - Предоставление методов взаимодействия с API продукта.
 - Являться делегатом и выполнять протокол <Auth2_0_Delegate> для поддержки аутентификации.
 - Управлять полученным токеном. Храните проперти (на токен), записывать и удалять из памяти.
 --------------------------------------------------------------------------------------------------------------*/


@interface APIManager : NSObject <Auth2_0_Delegate>

#pragma mark - URLSession
/*--------------------------------------------------------------------------------------------------------------
 Этот класс поддерживает несколько способов имплементации соединения с интернетом.

 1) Все операции конфигурируются на базе общей сессии из 'RXNetworkOperation'.
 2) Вы создаете собственную сессию и устанавливаете ее в каждую операцию. 
 3) Вы также можете иметь любое количество кастомных сессий, для каждой возможной ситуации. 
 ---
 (⚠️) У вас также может быть ситуация, когда вы хотите работать вместе с 'RXNetworkOperation', но при этом необходимо
  максимально кастомизировать сессию, то в свойстве 'operation.privateSession' можно установить значение
 'APIManager.defaultSession' каждой операции.
 --------------------------------------------------------------------------------------------------------------*/
@property (class, nonatomic, readonly, strong) NSURLSession* defaultSession;


#pragma mark - Queues
/*--------------------------------------------------------------------------------------------------------------
 Очереди, в которых по умолчанию выполняются все сетевые операции.
 --------------------------------------------------------------------------------------------------------------*/
@property (class, nonatomic, readonly, strong) NSOperationQueue* aSyncQueue;

@property (class, nonatomic, readonly, strong) NSOperationQueue* syncQueue;


#pragma mark - Token Property
/*--------------------------------------------------------------------------------------------------------------
 В проперти хранится токен, полученный от сервера. Если вы ранее получили его, а затем перезапустили приложение,
 переопределенный геттер извлечет токен из самой 'Keychain'.
 --------------------------------------------------------------------------------------------------------------*/
@property (class, nonatomic, strong, nullable) Token* token;



#pragma mark - BaseURL & EndPoint
/*--------------------------------------------------------------------------------------------------------------
 Свойство создано для удобства настройки запросов в будущем. Вы можете установить базовый префикс
 'https://api.vk.com/method/', который будет добавлен ко всем запросам API.
 --------------------------------------------------------------------------------------------------------------*/
@property (class, nonatomic, strong, nullable) NSString* baseURL;


/*--------------------------------------------------------------------------------------------------------------
 Возвращает результат соединения двух строк. 'baseURL' и значение из аргумента 'method'.
 --------------------------------------------------------------------------------------------------------------*/
+ (NSString*) baseURLappend:(NSString*)method;


#pragma mark - Customization
/*--------------------------------------------------------------------------------------------------------------
 Метод создан для возможности дополнительной настройки 'APIManager'a перед использованием.
 Например вы хотите задать некие дополнительные пользовательские параметры.
 В можете сделать это, вызывав данный метод внутри 'didFinishLaunchingWithOptions:..'.
 --------------------------------------------------------------------------------------------------------------*/
+ (void) prepareAPIManagerBeforeUsing:(nullable void(^)(void))completion;




#pragma mark - Network Operations

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
 .__   __.  _______ .___________.____    __    ____  ______   .______       __  ___
 |  \ |  | |   ____||           |\   \  /  \  /   / /  __  \  |   _  \     |  |/  /
 |   \|  | |  |__   `---|  |----` \   \/    \/   / |  |  |  | |  |_)  |    |  '  /
 |  . `  | |   __|      |  |       \            /  |  |  |  | |      /     |    <
 |  |\   | |  |____     |  |        \    /\    /   |  `--'  | |  |\  \----.|  .  \
 |__| \__| |_______|    |__|         \__/  \__/     \______/  | _| `._____||__|\__\
 
   ______   .______    _______ .______          ___   .___________. __    ______   .__   __.      _______.
  /  __  \  |   _  \  |   ____||   _  \        /   \  |           ||  |  /  __  \  |  \ |  |     /       |
 |  |  |  | |  |_)  | |  |__   |  |_)  |      /  ^  \ `---|  |----`|  | |  |  |  | |   \|  |    |   (----`
 |  |  |  | |   ___/  |   __|  |      /      /  /_\  \    |  |     |  | |  |  |  | |  . `  |     \   \
 |  `--'  | |  |      |  |____ |  |\  \----./  _____  \   |  |     |  | |  `--'  | |  |\   | .----)   |
  \______/  | _|      |_______|| _| `._____/__/     \__\  |__|     |__|  \______/  |__| \__| |_______/
 */
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*--------------------------------------------------------------------------------------------------------------
 Возвращает массив информации о пользователях
 --------------------------------------------------------------------------------------------------------------*/
+ (DTO*) usersGet:(NSArray<NSString*>*)userIDs
           fields:(NSArray<NSString*>* _Nullable)fields
       completion:(nullable void(^)(NSArray<UserProfile*>* _Nullable userProfiles, BO* op))completion;


/*--------------------------------------------------------------------------------------------------------------
 Возвращает все фотографии пользователя или сообщества в антихронологическом порядке.
 --------------------------------------------------------------------------------------------------------------*/
+ (DTO*) photosCollectionFromID:(nullable NSString*)ownerID
                         offset:(NSInteger)offset
                          count:(NSInteger)count
                     completion:(nullable void(^)(PhotoGalleryCollection* _Nullable photoCollection, BO* op))completion;

/*--------------------------------------------------------------------------------------------------------------
 Возвращает массив записей со стены пользователя или сообщества
 --------------------------------------------------------------------------------------------------------------*/
+ (DTO*) wallGet:(nullable NSString*)ownerID
          offset:(NSInteger)offset
           count:(NSInteger)count
          filter:(nullable NSString*)filter
      completion:(nullable void(^)(NSArray<WallPost*>* _Nullable wallPosts, BO* op))completion;


/*--------------------------------------------------------------------------------------------------------------
 Позволяет создать запись на стене. Метод принимает массив attachments и самостоятельно выгружает их по одиночке.
 --------------------------------------------------------------------------------------------------------------*/
+ (GO*) wallPost:(nullable NSString*)ownerID
         message:(nullable NSString*)message
  attachmentsArr:(nullable NSArray<NSData*>*)attachments
       fromGroup:(BOOL)fromGroup
      completion:(nullable void(^)(NSNumber* _Nonnull postID, BO* op))completion;


/*--------------------------------------------------------------------------------------------------------------
 Позволяет создать запись на стене. Метод принимает строку attachments (то есть требует адресса уже загруженного контента)
 --------------------------------------------------------------------------------------------------------------*/
+ (DTO*) wallPost:(nullable NSString*)ownerID
          message:(nullable NSString*)message
      attachments:(nullable NSString*)attachments
        fromGroup:(BOOL)fromGroup
       completion:(nullable void(^)(NSNumber* _Nullable postID, BO* op))completion;


/*--------------------------------------------------------------------------------------------------------------
 Метод загружает массив изображений на сервер.
 Ограничения: не более 6 фотографий за один раз в методе.
 --------------------------------------------------------------------------------------------------------------*/
+ (GO*) uploadImages:(NSArray<NSData*>*)imagesData
              userID:(nullable NSString*)userID
             groupID:(nullable NSString*)groupID
          completion:(nullable void(^)(NSArray<NSDictionary*>* _Nullable savedImages, GO* op))completion;


/*--------------------------------------------------------------------------------------------------------------
Возвращает список друзей пользователя
 --------------------------------------------------------------------------------------------------------------*/
+ (DTO*) friendListForUserID:(nullable NSString*)ownerID
                       order:(nullable NSString*)order
                      fields:(NSArray<NSString*>* _Nullable)fields
                       count:(NSInteger)count
                      offset:(NSInteger)offset
                  completion:(void(^)(NSArray<Friend*>* _Nullable friends, BO* op))completion;


/*--------------------------------------------------------------------------------------------------------------
 Совершает запрос к серверу. Удаляет файлы cookie в 'WKWebsiteDataStore'.
 Сбрасывает значение 'APIManager.token' и удаляет токен из 'KeyChain'.
 --------------------------------------------------------------------------------------------------------------*/
+ (DTO*) logout:(nullable void(^)(void)) completion;




#pragma mark - <Auth2_0_Delegate>

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
   ______        ___      __    __  .___________. __    __      ___        ___
  /  __  \      /   \    |  |  |  | |           ||  |  |  |    |__ \      / _ \
 |  |  |  |    /  ^  \   |  |  |  | `---|  |----`|  |__|  |       ) |    | | | |
 |  |  |  |   /  /_\  \  |  |  |  |     |  |     |   __   |      / /     | | | |
 |  `--'  |  /  _____  \ |  `--'  |     |  |     |  |  |  |     / /_   __| |_| |
  \______/  /__/     \__\ \______/      |__|     |__|  |__|    |____| (__)\___/
 */
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*--------------------------------------------------------------------------------------------------------------
  'AuthViewController' вызывает этот метод у своего делегата и передает ему полученный токен.
 --------------------------------------------------------------------------------------------------------------*/
+ (void) receiveTokenFromWebViewAuth:(nullable Token*)token error:(nullable NSError*)error;

/*--------------------------------------------------------------------------------------------------------------
 Используя 'Router', показывает 'AuthViewController' и запускает процесс аутентификации.
 --------------------------------------------------------------------------------------------------------------*/
+ (void) authenticationProcess:(nullable AuthenticationCompletion)completion;



#pragma mark - Token Access Methods

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
 .___________.  ______    __  ___  _______ .__   __.
 |           | /  __  \  |  |/  / |   ____||  \ |  |
 `---|  |----`|  |  |  | |  '  /  |  |__   |   \|  |
     |  |     |  |  |  | |    <   |   __|  |  . `  |
     |  |     |  `--'  | |  .  \  |  |____ |  |\   |
     |__|      \______/  |__|\__\ |_______||__| \__|
 */
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

+ (BOOL) isThereTokenInKeychain;                //  Returns 'YES' if the token is written to the 'KeyChain'
+ (nullable Token*) restoreTokenFromKeychain;   //  Restores from 'KeyChain'

+ (void)     removeTokenInKeychain;             //  Deletes from 'KeyChain'
+ (NSError*) saveTokenInKeychain:(Token*)token; //  Saves in 'KeyChain'

/*--------------------------------------------------------------------------------------------------------------
  Обновляет значения для '@property token' и записывает новый экземпляр в 'KeyChain'
 --------------------------------------------------------------------------------------------------------------*/
+ (void) updateToken:(NSString*)accessToken expiresAfter:(NSString*)expiresAfter userID:(NSString*)userID;



#pragma mark - Helpers - Syntax Sugar

///////////////////////////////////////////////////////////////////////////////
/*
  __    __   _______  __      .______    _______ .______          _______.
 |  |  |  | |   ____||  |     |   _  \  |   ____||   _  \        /       |
 |  |__|  | |  |__   |  |     |  |_)  | |  |__   |  |_)  |      |   (----`
 |   __   | |   __|  |  |     |   ___/  |   __|  |      /        \   \
 |  |  |  | |  |____ |  `----.|  |      |  |____ |  |\  \----.----)   |
 |__|  |__| |_______||_______|| _|      |_______|| _| `._____|_______/
 */
///////////////////////////////////////////////////////////////////////////////

/*--------------------------------------------------------------------------------------------------------------
 Ниже будут представленны методы который позволяют сократить синтаксис кода при работе с сетевым слоем.
 --------------------------------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------------------------------
 Метод вызывается внутри групповых операций, чтобы прекращать выполнение последующих операций если текущая была
 завершена с ошибкой. Метод вызывает переданный 'completion' блок если операция содержит 'error'.
 --------------------------------------------------------------------------------------------------------------*/
+ (NSError*) callCompletion:(nullable void(^)(NSError* _Nullable error))completion ifOccuredErrorInOperation:(BO*)op;

/*--------------------------------------------------------------------------------------------------------------
 Метод создан для сокращения синтаксиса.
 Вызывается внутри 'completion' блоков методов класса APIManager.
 --------------------------------------------------------------------------------------------------------------*/
+ (NSError*) callCompletionWithTwoArg:(nullable void(^)(NSError* _Nullable error, id _Nullable arg1))completion ifOccuredErrorInOperation:(BO*)op;

+ (NSError*) callCompletionWithThreeArg:(nullable void(^)(NSError* _Nullable error, id _Nullable arg1, id _Nullable arg2))completion ifOccuredErrorInOperation:(BO*)op;

@end
