#import "APIManager.h"
#import "APIMethods.h"

NS_ASSUME_NONNULL_BEGIN


/*--------------------------------------------------------------------------------------------------------------
 🌐🍑 'APIManager(Utilites)' - содержит методы косвенно используемые в 'APIManager' и его категориях.
 ---------------
 Содержит методы помогающие осуществлять корректное функционирование 'APIManager', которые невозможно поместить
 в любые другие его категории по причине того что не входят в их круг фунциональных обязанностей.
 
 Например это могут быть методы которые:
 - конвертируют 'NSDictionary' в 'NSData'.
 - определяет расширение файла по бинарному коду.
 - конвертирует значение 'enum' в 'NSString'
--------------------------------------------------------------------------------------------------------------*/

@interface APIManager (Utilites)

/*--------------------------------------------------------------------------------------------------------------
 Конвертирует значения 'enum' в 'NSString'
 --------------------------------------------------------------------------------------------------------------*/
+ (NSString*) convertAPIMethodToString:(APIMethod)enumValue;

/*--------------------------------------------------------------------------------------------------------------
 Возвращает 'mimeType' после анализа 'NSData'
 --------------------------------------------------------------------------------------------------------------*/
+ (NSString *)mimeTypeForData:(NSData*)data;

/*--------------------------------------------------------------------------------------------------------------
 Возвращает расширение файла после анализа 'NSData'
 --------------------------------------------------------------------------------------------------------------*/
+ (NSString *)extensionForData:(NSData *)data;

/*--------------------------------------------------------------------------------------------------------------
 Конвертирует бинарный код в 'NSDictionary'
 --------------------------------------------------------------------------------------------------------------*/
+ (nullable NSDictionary*) convertDataToDict:(NSData*)data withError:(NSError**)error;

@end

NS_ASSUME_NONNULL_END
