//
//  Mapper.h
//  vk-networkLayer
//
//  Created by Admin on 03/08/2020.
//  Copyright © 2020 iOS-Team. All rights reserved.
//

#import <Foundation/Foundation.h>

NS_ASSUME_NONNULL_BEGIN

@class UserProfile;
@class WallPost;
@class Photo;
@class PhotoGalleryCollection;
@class Friend;

/*--------------------------------------------------------------------------------------------------------------
 📄 ➡️ 💾  'Mapper' - собирает моделей данных из json файлов.
 ---------------
  Главная задача класса это декомпозировать 'APIManager', вынося из него код парсинга и маппинга моделей.
 ---------------
 [⚖️] Duties:
 - Создавать модели данных из полученного json.
 --------------------------------------------------------------------------------------------------------------*/

@interface Mapper : NSObject

/*--------------------------------------------------------------------------------------------------------------
 Возвращает массив объектов содержащих детальную информацию о пользователях.
 --------------------------------------------------------------------------------------------------------------*/
+ (nullable NSArray<UserProfile*>*) usersGetFromJSON:(NSDictionary*)json error:(NSError*_Nullable* _Nullable)error;

/*--------------------------------------------------------------------------------------------------------------
 Возвращает массив записей со стены пользователя или сообщества.
 --------------------------------------------------------------------------------------------------------------*/
+ (nullable NSArray<WallPost*>*) wallPostsFromJSON:(NSDictionary*)json error:(NSError*_Nullable* _Nullable)error;

/*--------------------------------------------------------------------------------------------------------------
 Возвращает все фотографии пользователя или сообщества в антихронологическом порядке.
 --------------------------------------------------------------------------------------------------------------*/
+ (nullable NSArray<Photo*>*)  photosGetAllFromJSON:(NSDictionary*)json error:(NSError*_Nullable* _Nullable)error;

/*--------------------------------------------------------------------------------------------------------------
 Возвращает все фотографии пользователя или сообщества в антихронологическом порядке.
 --------------------------------------------------------------------------------------------------------------*/
+ (nullable PhotoGalleryCollection*) photosCollectionFromJSON:(NSDictionary*)json error:(NSError*_Nullable* _Nullable)error;

/*--------------------------------------------------------------------------------------------------------------
 Возвращает список идентификаторов друзей пользователя или расширенную информацию о друзьях пользователя
 --------------------------------------------------------------------------------------------------------------*/
+ (nullable NSArray<Friend*>*) friendsFromJSON:(NSDictionary*)json error:(NSError*_Nullable* _Nullable)error;

@end

NS_ASSUME_NONNULL_END
