#import <UIKit/UIKit.h>

NS_ASSUME_NONNULL_BEGIN

/*--------------------------------------------------------------------------------------------------------------
 (👱‍♂️📱) 'UserProfileTVC' - Контроллер отображает страницу пользователя.
 --------------------------------------------------------------------------------------------------------------*/

@interface UserProfileTVC : UITableViewController

#pragma mark - Initialization

/*--------------------------------------------------------------------------------------------------------------
 Инициализирует контроллер с 'userID'. (ViewModel создает самостоятельно)
 --------------------------------------------------------------------------------------------------------------*/
+ (UserProfileTVC*) initWithUserID:(nullable NSString*)userID;

@end

NS_ASSUME_NONNULL_END
